# Task description for 1 task

""""
1. Напишіть алгоритм, який приймає введене користувачем число (як int) і, 
за допомогою операторів % (остача від ділення), / (ділення) і // (цілочисельне ділення) збережіть і виведіть 
на екран значення змінної (стрічку), яка виглядає, як введене число, але задом наперед
Підказка: число % 10 поверне вам останню цифру цього числа, число // 10 вертає вам число без останньої цифри. 
Використовуйте цикл while. Проходячись по циклу, щоразу діставайте останню цифру і додавайте її як стрічку
 до змінної результату.
"""

i = int(input("Enter int number: "))
result = ''

while i > 0:
    result = result + str(i % 10)
    i = i // 10

print (result)