"""
7. У змаганні з програмування беруть участь синя та червона команди програмістів. 
Команда, що переможе, отримує торт! Єдина складність полягає в тому, що в обох 
командах різна кількість учасників, але організаторам треба на початку розрізати торт таким чином, 
щоб, незалежно від того, яка команда виграє, кожен учасник отримав би цілу кількість шматочків торта, 
але при цьому щоб шматочків не було забагато (бо будуть занадто дрібними і буде незручно їсти). 
Наприклад, якщо в синій команді 2 людей, а в червоній - 8, торт треба розрізати на 8 шматочків. 
Якщо в синій команді 4 людини, а в червоній - 6, торт треба розрізати на 12 шматочків. 
Якщо в синій команді 5 людей, а в червоній - 6, торт треба розрізати на 30 шматочків. 
Нехай користувач введе кількість учасників для обох команд і доможіть організаторам знайти 
необхідну кількість шматочків торта. 
Підказка: пошукайте в Інтернеті, що таке НСК (найменше спільне кратне) і подумайте, 
як би в реальному житті без програмування Ви би вирішили таку проблему. Використовуйте if/else/while/break

"""

try:
    number_blue = int (input("Please enter number for Blue team: "))
except ValueError:
    print("Please enter int number. Try again")
try:
    number_red = int (input("Please enter number for Red team: "))
except ValueError:
    print("Please enter int number. Try again")
