"""
8. Нехай користувач введе якусь стрічку, яка може містити різні типи дужок - (), {}, [] 
(вони можуть бути вкладеними одні в одних). Спробуйте знайти відповідь на питання, чи 
кількість відкриваючих дужок дорівнює кількості закриваючих дужок.
Завдання з зірочкою: Крім перевірки кількості, також перевірте, 
чи вони відкриваються і закриваються правильно. Наприклад, "({[]})" це 
правильно, а "({[}])" - ні (тому що фігурні дужки закрилися, але квадратна дужка всередині них лишилася відкритою).

P.S. Як додатковий пункт, в кожній задачі спробуйте зробити так, щоб програма не падала
неочікувано (якщо, наприклад, ввести неочікувані дані). Для цього 
використовуйте try/except(для різних типів помилок)/else/finally. Також, після вирішення, передивіться,
 чи десь Ви можете додати якісь додаткові перевірки, щоб передбачити всі сценарії введення даних
 користувачем. Майте також на увазі, що навіть коли я кину свої варіанти рішень, це не означає, що
 вони єдині правильні чи найбільш оптимальні (для деяких задач в мене так само буде кілька варіантів вирішень).
"""

n1 = 0
n2 = 0
n3 = 0

str = input("Please enter (, ), {, }, [, or ]: ")

for i in str:
    if i == "(":
        n1 += 1
    elif i == ")":
        n1 -= 1
    elif i == "{":
        n1 += 1
    elif i == "}":
        n1 -= 1
    elif i == "[":
        n1 += 1
    elif i == "]":
        n1 -= 1

if n1 == 0:
    print (f"{n1} - Good. All ( are closed, the number of ( and ) are the same")
else:
    print (f"{n1} - The number of ( and ) are not the same!")

if n2 == 0:
    print (n2, " - Good. The number of { and } are the same!")
else:
    print (n2, " - The number of { and } are not the same!")
if n3 == 0:
    print (f"{n3} - Good. The number of [ and ] are the same!")
else:
    print (f"{n3} - The number of [ and ] are not the same!")
